FILES/Catalogs/ЭлементОтбора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ЭлементОтбора</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеУсловия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложноеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииОписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУсловия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/Catalogs/ЭлементОтбора/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьJSONДерева()
	
	ОбъектСервер  = РеквизитФормыВЗначение("Объект");	
	Стр = ОбъектСервер.Условие;// Политики[ТС].Условие;
	Если НЕ ЗначениеЗаполнено(Стр) Тогда
		Стр = ""
	КонецЕсли;
	
	Возврат Стр;
КонецФункции

&НаСервере
Функция УстановитьJSONВДерево(Результат, ТС)
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда	
		ОбъектСервер = РеквизитФормыВЗначение("Объект");	
		ОбъектСервер.Условие = Результат.ДеревоПравил; //Новый ХранилищеЗначения(Результат.ДеревоПравил, Новый СжатиеДанных(9));
		ОбъектСервер.ПредставлениеУсловия = Результат.Представление;
		ЗначениеВРеквизитФормы(ОбъектСервер, "Объект");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияОтбора(Результат, Параметр) Экспорт
	УстановитьJSONВДерево(Результат, Параметр);
КонецПроцедуры


&НаКлиенте
Процедура ПредставлениеУсловияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	//ТС = Элементы.Политики.ТекущиеДанные.ПолучитьИдентификатор();
	
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияОтбора", ЭтотОбъект);
	
	Пар = Новый Структура("ДеревоПравил, ОбъектУсловия");
	Пар.ДеревоПравил = ПолучитьJSONДерева();
	Пар.ОбъектУсловия = Объект.ОбъектУсловия;

	ОткрытьФорму("ОбщаяФорма.ФормаОтбора", Пар,,,,,Оп);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка = Справочники.ЭлементОтбора.ПустаяСсылка() Тогда
		//Это новый
		Если ЭтаФорма.Параметры.ЗначенияЗаполнения.Свойство("ОбъектУсловия") Тогда
			Объект.ОбъектУсловия = ЭтаФорма.Параметры.ЗначенияЗаполнения.ОбъектУсловия;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
